Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>КорректировкаРеализации</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БНФОСпособОтраженияКорректировокНаУменьшение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/БНФОДоговорыКредитовИДепозитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>БНФОДоговорыКредитовИДепозитов</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаРасчетовПоПрочимРасходам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерДоговора</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.БНФОХарактерДоговораКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаКорректировок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаНачисленияПроцентов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКомиссии</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.БНФОТипыКомиссииКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассДепозита</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.БНФОКлассыДепозитовРазмещенныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоДосрочноеВыбытие</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСрочности</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.БНФОТипыСрочностиКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаРезервовПодОбесценение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаРасчетовПоПрочимДоходам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаОсновногоДолга</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаПогашенияИмуществом</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаРасчетовПоПроцентам</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаНачисленияПрочихРасходов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчетаНачисленияПрочихДоходов</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОГруппыФинансовогоУчетаФинансовыхИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pcru_ex_ProductType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>pcru_ex_СвязанныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БНФОДоговорыКредитовИДепозитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/КорректировкаРеализации/Ext/ObjectModule.bsl
//&Вместо("ЗаполнитьПоДокументуОснованию")
Процедура pcru_ex_ЗаполнитьПоДокументуОснованию(Основание, ВидОперацииЗаполнения)
	//
	//ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
	//
	//Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) <> Тип("Структура") Тогда
	//	ДокументСсылка = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(Основание, Ложь);
	//
	//	Если ЗначениеЗаполнено(Основание) И ТипЗнч(Основание) = Тип("ДокументСсылка.ОтчетКомиссионераОПродажах")
	//		И НЕ Документы.ОтчетКомиссионераОПродажах.ДокументСозданПоПравиламПостановления914(Основание) Тогда
	//		
	//		ЭтотОбъект.Организация = Основание.Организация;
	//		ТекстСообщения = 
	//			НСтр("ru='В отчете комиссионера указан покупатель, отличный от комиссионера. 
	//				|В этом случае в качестве основания следует указывать счет-фактуру покупателя!'");
	//		ВызватьИсключение ТекстСообщения;
	//		
	//		Возврат;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//
	//ЭтотОбъект.Организация = Основание.Организация;
	//ЭтотОбъект.ДокументРеализации = Основание;
	//ЗаполнитьСвойстваШапки();
	//Документы.КорректировкаРеализации.ЗаполнитьПоДокументу(ЭтотОбъект);
	//ЭтотОбъект.КорректироватьБУиНУ = Истина;//Документ.ДоступнаКорректировкаБУиНУ(ЭтотОбъект.ДокументРеализации);
	//ЭтотОбъект.КорректироватьНДС = Истина;
	//
	//Если ТипЗнч(Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
	//	ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
	//	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "Грузоотправитель, Грузополучатель, ОтпускПроизвел, СопроводительныеДокументы");
	//	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗначенияРеквизитов);
	//КонецЕсли;
	//
	//ПараметрыИсправления = Документы.КорректировкаРеализации.СформироватьПараметрыИсправленияКорректировочногоДокумента(
	//	?(ВидОперацииЗаполнения <> Неопределено, ВидОперацииЗаполнения, ВидОперации), ДокументРеализации, ИсправляемыйДокументРеализации);
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыИсправления);
	//
	//Если КорректироватьБУиНУ Тогда
	//	ДокументРеализацииСсылка = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументРеализации(ДокументРеализации, Истина);
	//	
	//	РеквизитыДокументаРеализации = Неопределено;
	//	Если ЗначениеЗаполнено(ДокументРеализацииСсылка) Тогда
	//		РеквизитыДокументаРеализации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРеализацииСсылка, "Дата");
	//	КонецЕсли;
	//	ДатаДокументаРеализации	= ?(РеквизитыДокументаРеализации <> Неопределено, РеквизитыДокументаРеализации.Дата, '00010101');
	//	
	//	Если ЗначениеЗаполнено(ДокументРеализацииСсылка) 
	//		И Год(ДатаДокументаРеализации) < Год(Дата) Тогда
	//		
	//		Если НЕ ЗначениеЗаполнено(СтатьяПрочихДоходовИРасходов) Тогда
	//			СтатьяПрочихДоходовИРасходов = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ПрочиеДоходыИРасходы.ИсправительныеЗаписиПоОперациямПрошлыхЛет");
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура pcru_ex_ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	БНФОДоговорыКредитовИДепозитов.Номер КАК Номер,
	|	БНФОДоговорыКредитовИДепозитов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БНФОДоговорыКредитовИДепозитов КАК БНФОДоговорыКредитовИДепозитов
	|ГДЕ
	|	БНФОДоговорыКредитовИДепозитов.Контрагент = &Контрагент";
	Запрос.УстановитьПараметр("Контрагент",Контрагент );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ндог = 	Выборка.Номер;
	КонецЦикла;
	Для каждого Проводка Из  Движения.БНФОБанковский Цикл
		Если Лев(Проводка.СчетДт.Код,1) = "7" Тогда
			Если ЗначениеЗаполнено(Ндог)  Тогда
				Нск =  1;
				Для каждого ВидСубконто Из Проводка.СчетДт.ВидыСубконто Цикл
					Если  ВидСубконто.ВидСубконто.Наименование = "Тип затрат"  Тогда
						ДатаВыплаты = pcru_ex_WSWORKS.ПолучитьДатуПодписания(Ндог);
						Если ДатаВыплаты <> Неопределено Тогда
							Если ДатаВыплаты < Дата(2020,5,1,0,0,0) Тогда
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000092")); 
							Иначе
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000093")); 
							КонецЕсли;
						КонецЕсли; 
					КонецЕсли;
					Нск = Нск + 1;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
		Если Лев(Проводка.СчетКт.Код,1) = "7" Тогда
			Если ЗначениеЗаполнено(Ндог)  Тогда
				Нск =  1;
				Для каждого ВидСубконто Из Проводка.СчетКт.ВидыСубконто Цикл
					Если  ВидСубконто.ВидСубконто.Наименование = "Тип затрат"  Тогда
						ДатаВыплаты = pcru_ex_WSWORKS.ПолучитьДатуПодписания(Ндог);
						Если ДатаВыплаты <> Неопределено Тогда
							Если ДатаВыплаты < Дата(2020,5,1,0,0,0) Тогда
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000092")); 
							Иначе
								БНФОБухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, Нск, Справочники.БНФОСубконто.НайтиПоКоду("000000093")); 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Нск = Нск + 1;
				КонецЦикла; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	Движения.БНФОБанковский.Записывать = Истина;
	Движения.Записать();
	
КонецПроцедуры

//&Перед("ОбработкаПроведения")
//Процедура pcru_ex_ОбработкаПроведения(Отказ, РежимПроведения)
//	ЭтоЗагрузкаИзНав = Ложь;
//	Если ДополнительныеСвойства.Свойство("ЭтоЗагрузкаИзНав",ЭтоЗагрузкаИзНав) Тогда
//		ЭтоЗагрузкаИзНавЕсли = ДополнительныеСвойства.ЭтоЗагрузкаИзНав;
//	КонецЕсли; 
//	Если Не ЭтоЗагрузкаИзНавЕсли Тогда
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Ссылка КАК Ссылка
//		|ИЗ
//		|	Справочник.pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий КАК pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий
//		|ГДЕ
//		|	pcru_ex_ЗапланированноеВыполнениеРегламентныхЗаданий.Результат ПОДОБНО ""Задание Выполняется..""";
//		Выборка = Запрос.Выполнить().Выбрать();
//		Если Выборка.Следующий() Тогда
//			Отказ = Истина;
//			Сообщить("Идет загрузка из НАВ проведение ");
//			Возврат;
//		КонецЕсли;  
//	КонецЕсли; 	
//КонецПроцедуры
